---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.VertexPositionColored.Position
source: html/22dfd306-606b-4922-d373-4325f1b2e89f.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPositionColored.Position Property

The vertex's position.

## Syntax (C#)
```csharp
public XYZ Position { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null